#+title: TKRM
#+startup: showeverything
#+property: header-args :noweb yes :mkdirp yes

*** Setting up a build

To set up a build for the first time on a new machine (or to rebuild
from a clean slate), tangle this file and then run the following code
block:

#+BEGIN_SRC sh :results verbatim
#!/bin/sh

rm -rf build
mkdir build
cd build
cmake .. -DCMAKE_CXX_COMPILER=clang++ -DCMAKE_EXPORT_COMPILE_COMMANDS=ON
#+END_SRC

#+RESULTS:
#+begin_example
-- The CXX compiler identification is Clang 3.6.0
-- Check for working CXX compiler: /usr/bin/clang++
-- Check for working CXX compiler: /usr/bin/clang++ -- works
-- Detecting CXX compiler ABI info
-- Detecting CXX compiler ABI info - done
-- Detecting CXX compile features
-- Detecting CXX compile features - done
-- Configuring done
-- Generating done
-- Build files have been written to: /home/joseph/Git/tkrm/build
#+end_example

You should see the results with the output from CMake.

